Wait Receive Test Command


--->>>FLASH TEST

FlashID is 0xEF4017,Manufacturer Device ID is 0x16

д��������Ϊ:Hermes Flash Test Program
���������Ϊ:Hermes Flash Test Program
--->>>FLASH TEST OK

--->>>BT TEST

--->>send AT+SLEEP
--->>send command length:10
---<<set ok
--->>>BT TEST OK

--->>>WIFI TEST
command length:4
--->>send AT





ID:#DVT6-328
--->>>USART TEST OK

--->>>FLASH TEST

FlashID is 0xEF4017,Manufacturer Device ID is 0x16
д��������Ϊ:Hermes Flash Test Program
���������Ϊ:Hermes Flash Test Program
--->>>FLASH TEST OK
--->>>ETHERNET_MAC#ETHERNET*AT+*
--->>MAC_Hex: fd 1e b7 fd aa fb
<<-EEPROM-ERROR->> I2C ERROR Flag = 1

<<-EEPROM-ERROR->> I2C ERROR Flag = 1

<<-EEPROM-ERROR->> I2C ERROR Flag = 1





command 42 4d e3 0 0 1 72

---
>>>BT TEST

--->>send AT+SLEEP

--->>send command length:10

ID:#DVT6-328
--->>>USART TEST OK

--->>>FLASH TEST

FlashID is 0xEF4017,Manufacturer Device ID is 0x16

д��������Ϊ:Hermes Flash Test Program
��
�������Ϊ:Hermes Flash Test Program
--->>>FLASH TEST OK
--->>>ETHERNET_MAC#ETHERNET*AT+*
--->>MAC_Hex: fd 1e b7 fd aa fb
<<-EEPROM-ERROR->> I2C ERROR Flag = 1

<<-EEPROM-ERROR->

> I2C ERROR Flag = 1

<<-EEPROM-ERROR->> I2C ERROR Flag = 1



command 42
 4d e3 0 0 1 72

--->>>BT TEST

--->>send AT+SLEEP

--->>send command length:10

---<<set ok
--->>>BT TEST OK

--->
>>IIC TEST

<<-EEPROM-ERROR->> I2C ERROR Flag = 9

--->>>Power Value: 0 0 0
--->>>IIC TEST FAIL
--->>>POWER TEST FAIL

--->>>Ethernet TEST

DHCP�ӳ���δ����,���߲��ɹ�
ʹ�ö�����IP��Ϣ����W5500
W5500 IP��ַ   : 192.168.1.119
W5500 �������� : 255.255.255.0
W5500 ����     : 192.168.1.1

������ΪTCP������,��W5500��Ϊ TCP�ͻ���ȥ���
������IP:192.168.1.110
�����˿�:8443 
��ӳɹ��󣬷������������ݸ�W5500��W5500�����ض�Ӧ����
Ӧ�ó���ִ����
Please Wait about 33 second

--->>>BT TEST
--->>send AT+SLEEP
--->>send command length:10
---<<set ok
--->>>BT TEST OK

--->>>WIFI TEST
command length:4
--->>send AT







---<<set ok
command length:13
--->>send AT+CWMODE=3

---<<set ok
command length:15
--->>send AT+CIPSTAMAC?

--->>>WIFI_MAC#84:f3:eb:83:58:89*

---<<set ok
--->>> WIFI TEST OK








